Repository: 84000/data-translation-memory
Catalog: toh503_84000-the-detailed-account-of-the-previous-aspirations-of-the-seven-thus-gone-ones.tmx
Source language: bo
Languages: en

source: ཚོན་སྣ་ཚོགས་སུ་ཁ་སྒྱུར་བ་དག་སྦྱིན་པར་བྱའོ། །ཇི་ལྟར་འདོད་པ་བཞིན་དུ་རིན་པོ་ཆེའི་རྒྱན་སྣ་ཚོགས་དང་། སྤུད་པ་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། རོལ་མོའི་སྒྲ་དང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་རྣམས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག་ཅེས་བཏབ་སྟེ། །འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་དེ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སྨོན་ལམ་ཆེན་པོ་བཅུ་གཉིས་པོ་དེ་དག་བཏབ་པར་གྱུར་ཏོ།
en: May I fulfill all the wishes of beings with whatever types of jewelry, ornaments, garlands, perfumes, ointments, music, instruments, and drums they desire.’ Mañjuśrī, those are the twelve great aspirations that the blessed, thus-gone, worthy, and perfect Buddha Bhaiṣajya­guru­vaiḍūrya­prabha proclaimed long ago, when he was practicing bodhisattva conduct.

source: །འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་ཀྱི་རྒྱལ་པོ་དེའི་སྨོན་ལམ་གང་ཡིན་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་གང་ཡིན་པ་དེ་ནི་བསྐལ་པའམ། བསྐལ་པ་ལས་ལྷག་པར་ཡང་ཟད་པར་བྱར་མི་ནུས་སོ།
en: “Mañjuśrī, the aspirations of the Thus-Gone One Bhaiṣajya­guru­vaiḍūrya­prabharāja and the array of good qualities of his buddhafield cannot be exhausted over the course of an eon or even more than an eon.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་ཤིན་ཏུ་ཡོངས་སུ་དག་པ་སྟེ།
en: His buddhafield is utterly pure.

source: རྡོ་དང་། གསེག་མ་དང་། གྱོ་མོ་མེད་པ།
en: There are no stones, pebbles, or gravel;

source: འདོད་པའི་སྐྱོན་མེད་པ།
en: there are no faults related to desire;

source: ངན་སོང་དང་སྡུག་བསྔལ་གྱི་སྒྲ་མེད་པ།
en: there are no cries of suffering and the lower realms;

source: ས་རྡོ་དང་། རྩིག་པ་དང་། ར་བ་དང་། རྟ་བབས་དང་། སྐར་ཁུང་གི་དྲ་བ་དང་། བ་གམ་ནི་བཻ་ཌཱུརྱའི་རང་བཞིན་ཅན། ཀ་ཞུ་ནི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རང་བཞིན་ཅན་ཏེ།
en: The foundation, walls, fences, archways, latticework windows, and turrets are made of blue beryl, and the pillar capitals are made of the seven precious substances.

source: འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ཅི་འདྲ་བ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་བཻ་ཌཱུརྱར་སྣང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཡང་དེ་དང་འདྲའོ།
en: The array of good qualities of the world Vaiḍūryanirbhāsa is equal to that of the world Sukhāvatī.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དེ་དག་གི་ནང་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཙོ་བོ་གཉིས་ཡོད་དེ།
en: “There are two bodhisattva great beings who are foremost among the immeasurable and innumerable bodhisattvas in that world.

source: གཅིག་གི་མིང་ནི་ཉི་མ་ལྟར་རྣམ་པར་སྣང་བྱེད་ཅེས་བྱ། གཉིས་པའི་མིང་ནི་ཟླ་བ་ལྟར་རྣམ་པར་སྣང་བྱེད་ཅེས་བྱ་སྟེ།
en: The first is named Sūryavairocana and the second is named Candravairocana.

source: དེ་དག་ནི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་དེའི་དམ་པའི་ཆོས་ཀྱི་མཛོད་འཛིན་པའོ།
en: These two maintain the treasury of the holy Dharma of the blessed Thus-Gone One Bhaiṣajya­guru­vaiḍūrya­prabha.

source: །འཇམ་དཔལ་དེ་ལྟ་བས་ན་དད་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོས་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་སྨོན་ལམ་ཐོབ་ཅིག །ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: Mañjuśrī, that is why a faithful son or daughter of good family should make the aspiration to be born in that buddhafield.”

source: འཇམ་དཔལ་སེམས་ཅན་སོ་སོའི་སྐྱེ་བོ་གང་དག་དགེ་བ་དང་། མི་དགེ་བ་མི་ཤེས་པ་དག་ཡོད་དེ།
en: The Blessed One continued to address Mañjuśrīkumārabhūta saying, “Mañjuśrī, there are ordinary beings who do not know about virtue and nonvirtue.

source: དེ་དག་ནི་ཆགས་པས་ཟིལ་གྱིས་ནོན་པ། སྦྱིན་པ་དང་སྦྱིན་པའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་མི་ཤེས་པའོ།
en: They are overcome by greed and do not understand how generosity and the ripened result of generosity.

source: །དེ་དག་ནི་བྱིས་པ་གླེན་པ་དད་པའི་དབང་པོ་དང་བྲལ་བ།
en: They are childish and foolish, lacking the capacity for faith.

source: ནོར་སོགས་ཤིང་བསྲུང་བ་ལ་མངོན་པར་བརྩོན་གྱི། སྦྱིན་པ་ཡང་དག་པར་འགྱེད་པ་ལ་དེ་དག་གི་སེམས་མི་འགྲོ་བ་སྟེ།
en: As they strive to accumulate and maintain wealth , their minds are not disposed toward generosity and sharing.

source: སྦྱིན་པའི་དུས་ཉེ་བར་གནས་པ་ན་རང་གི་ལུས་ཀྱི་ཤ་ལས་བཅད་པ་བཞིན་དུ་ཡིད་མི་དགའ་བར་འགྱུར་བའོ།
en: When it is time to give a gift, they become dejected as if they were cutting the flesh from their own bodies.

source: །སེམས་ཅན་དེ་དག་ནི་བདག་ཉིད་ཀྱང་དུ་མ་ཡོངས་སུ་མི་སྤྱོད་ན། ཕ་མ་དང་། ཆུང་མ་དང་། བུ་དང་། བུ་མོ་ལ་མི་སྟེར་བ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་རྣམས་ལ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས། གཞན་སློང་བ་རྣམས་ལ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Many of those beings do not even allow themselves to enjoy material wealth , let alone provide for their parents, wives, sons, and daughters, their male and female servants and employees, and for beggars.

source: སེམས་ཅན་དེ་ལྟ་བུ་དེ་དག་ནི་འདི་ནས་ཤི་འཕོས་ནས་ཡི་དགས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེ་བར་འགྱུར་རོ། །ཡང་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེ་བར་འགྱུར་རོ།
en: “When such beings pass away, they are reborn in the hungry ghost realm or as animals.

source: །དེ་ལ་གང་དག་སྔོན་མིར་གྱུར་པ་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་དེའི་མཚན་ཐོས་པར་གྱུར་པ་དེ་དག་ནི་གཤིན་རྗེའི་འཇིག་རྟེན་ན་གནས་ཀྱང་རུང་། དུད་འགྲོའི་སྐྱེ་གནས་ན་གནས་ཀྱང་རུང་སྟེ།
en: For those among them who have heard the name of the blessed Thus-Gone One Bhaiṣajya­guru­vaiḍūrya­prabha in their previous lives as humans—whether they find themselves in the world of Yama or in the animal realm—that Thus-gone One’s name will appear there before them.

source: དེར་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་མངོན་དུ་འགྱུར་ཞིང་དྲན་མ་ཐག་ཏུ་རིམ་གྱིས་དེ་ནས་ཤི་འཕོས་ནས་ཡང་མིའི་འཇིག་རྟེན་དུ་སྐྱེ་བར་འགྱུར།
en: Simply be recollecting it, after they eventually pass away, they will once again be born in the human realm.

source: ཚེ་རབས་དྲན་པར་འགྱུར་རོ། །ངན་འགྲོའི་འཇིགས་པས་སྐྲག་ནས་ཡང་འདོད་པའི་ཡོན་ཏན་དག་དོན་དུ་མི་གཉེར་བ་དང་། སྦྱིན་པ་ལ་མངོན་པར་དགའ་བ་དང་། སྦྱིན་པའི་བསྔགས་པ་བརྗོད་པ་དང་། བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བར་འགྱུར་ཏེ།
en: They will remember their former lifetimes, grow anxious out of fear of the lower realms, and no longer concern themselves with sense pleasures. They will delight in generosity, promote generosity, and give away everything that they own.

source: རིམ་གྱིས་རང་གི་མགོ་དང་། ལག་པ་དང་། རྐང་པ་དང་། མིག་དང་། ཤ་དང་། ཁྲག་ཀྱང་སློང་བ་རྣམས་ལ་རབ་ཏུ་སྦྱིན་པར་འགྱུར་ན། ནོར་གྱི་གྱི་ཕུང་པོ་གཞན་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Eventually, they will even give their own head, hands, feet, eyes, flesh, and blood to anyone who asks, let alone other things like accumulated wealth.

source: འཇམ་དཔལ་གཞན་ཡང་སེམས་ཅན་གང་དག་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་བསླབ་པའི་གནས་འཛིན་པ་དག་ཡོད་དེ། དེ་དག་ཚུལ་ཁྲིམས་ལོག་པར་ཞུགས་ཤིང་ལྟ་བ་ལོག་པར་ཞུགས་ནས་གང་དག་ཚུལ་ཁྲིམས་དང་ལྡན་པ་དེ་དག་ནི་ཚུལ་ཁྲིམས་ཙམ་བསྲུང་གི་མང་དུ་ཐོས་པ་ཡོངས་སུ་མི་ཚོལ་ཏེ།
en: “Moreover, Mañjuśrī, there are beings who hold the precepts of the thus-gone ones, yet violate discipline and engage in wrong views.

source: དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་མདོ་སྡེ་རྣམས་ཀྱི་དོན་ཟབ་མོ་མི་ཤེས། གང་དག་མང་དུ་ཐོས་པ་དེ་དག་ནི་ལྷག་པའི་ང་རྒྱལ་ཅན་དུ་འགྱུར་ཏེ།
en: Those who maintain discipline but do not seek erudition do not understand the profound meaning of the discourses that the Thus-Gone One has taught.

source: ང་རྒྱལ་གྱིས་ནོན་པས་གཞན་དག་ལ་ཕྲག་དོག་བྱེད་ཅིང་དམ་པའི་ཆོས་ལ་དབང་ཟ་བར་འགྱུར། སྤོང་བར་འགྱུར་རོ།
en: Those who do become erudite develop excessive pride, and because they are overcome by their pride, they act with jealousy toward others, and misuse and forsake the holy Dharma.

source: །མི་བླུན་པོ་དེ་ལྟ་བུ་དེ་དག་ནི་བདུད་ཀྱི་ཕྱོགས་པ་སྟེ། བདག་ཀྱང་ལམ་ངན་པར་ཞུགས་ལ་སེམས་ཅན་གཞན་གང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དག་ཀྱང་གཡང་ས་ཆེན་པོར་ལྟུང་བར་བྱེད་པའོ།
en: Such foolish people who side with Māra pursue a bad path themselves and cause many billions of other beings to fall into the great abyss.

source: །སེམས་ཅན་དེ་ལྟ་བུ་དེ་དག་ནི་སེམས་ཅན་དམྱལ་བ་མི་བཟད་པར་འགྲོ་བར་འགྱུར་རོ།
en: Those beings are reborn amidst the horrors of hell.

source: །གང་དག་སྔོན་མིར་གྱུར་པ་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་དེའི་མཚན་ཐོས་པར་གྱུར་པ། དེ་དག་ནི་སེམས་ཅན་དམྱལ་བ་ན་གནས་ཀྱང་དེར་སངས་རྒྱས་ཀྱི་མཐུས་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་མངོན་དུ་འགྱུར་ཏེ།
en: “For those who have heard the name of the blessed Thus-Gone One Bhaiṣajya­guru­vaiḍūrya­prabha in a previous life as a human being, even for those who live in the hell realms, the power of the Buddha will cause the name of that thus-gone one to appear before them.

source: དེ་དག་དེ་ནས་ཤི་འཕོས་ནས་ཡང་མིའི་འཇིག་རྟེན་དུ་སྐྱེ་བར་འགྱུར།
en: Then, when they pass away, they will be reborn in the human realm.

source: ཡང་དག་པའི་ལྟ་བ་ཅན་དང་། བརྩོན་འགྲུས་དང་ལྡན་པ་དང་། དགེ་བའི་བསམ་པ་ཅན་དུ་འགྱུར་རོ།
en: They will maintain the correct view, be diligent, and their minds will be predisposed toward virtue.

source: །དེ་དག་ཁྱིམ་སྤངས་ཏེ་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་མཐར་གྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པར་འགྱུར་རོ།
en: They will leave home, go forth in the teaching of the Thus-Gone One, and will finally practice bodhisattva conduct.

source: །འཇམ་དཔལ་གཞན་ཡང་སེམས་ཅན་གང་དག་བདག་གི་བསྔགས་པ་བརྗོད་ཅིང་ཕྲག་དོག་གིས་གཞན་དག་ལ་མི་སྙན་པ་བརྗོད་པ་ཡོད་དེ།
en: “Moreover, Mañjuśrī, there are beings who praise themselves and denigrate others out of jealousy.

source: བདག་ལ་བསྟོད་ཅིང་གཞན་ལ་སྨོད་པའི་སེམས་ཅན་དེ་དག་ངན་སོང་གསུམ་པོ་དག་ཏུ་ལོ་སྟོང་ཕྲག་མང་པོར་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་རོ།
en: Beings who sing their own praises and denigrate others will suffer in the three lower realms for many thousands of years.

source: །དེ་དག་ལོ་སྟོང་ཕྲག་དུ་མ་འདས་ནས་དེ་ནས་ཤི་འཕོས་ནས་བ་ལང་དང་། རྟ་དང་། རྔ་མོ་དང་། བོང་བུ་ལ་སོགས་པ་དུད་འགྲོའི་སྐྱེ་གནས་རྣམས་སུ་སྐྱེ་བར་འགྱུར།
en: After many thousands of years have passed, they will pass away and be reborn in the animal realm as cows, horses, camels, donkeys, and so forth.

source: ལྕུག་ལྕག་དང་དབྱུག་ལྕག་རྣམས་ཀྱིས་བརྡེག་པ་དང་། བཀྲེས་པ་དང་། སྐོམ་པས་ལུས་ཉེན་པ་དང་། ཁལ་ཆེན་པོ་བཀལ་ཏེ་ལམ་དུ་འགྲོ་བར་འགྱུར་རོ།
en: They will be beaten with whips and rods, their bodies will be afflicted by hunger and thirst, and they will have to carry great loads as they move along the road.

source: །གལ་ཏེ་བརྒྱ་ལ་མིའི་རྙེད་པ་རྙེད་པ་ན་ཡང་རྟག་ཏུ་རིགས་དམའ་བ་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར། བྲན་དུ་འགྱུར་ཞིང་གཞན་གྱི་དབང་དུ་འགྱུར་རོ།
en: Even if they do attain a human birth, they will always be born into families of low standing, be servants, and be under another person’s control.

source: །གང་དག་སྔོན་མིར་གྱུར་པ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་དེའི་མཚན་ཐོས་པར་གྱུར་པ་དེ་དག་ནི། དགེ་བའི་རྩ་བ་དེས་སྡུག་བསྔལ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར།
en: “Those who have heard the name of the blessed, thus-gone, worthy, and perfect Buddha Bhaiṣajya­guru­vaiḍūrya­prabha in a previous life as a human being will be liberated from all manner of suffering due to that root of virtue.

source: དབང་པོ་རྣོ་བར་འགྱུར། མཁས་པ་དང་། གསལ་བ་དང་། ཡིད་གཞུངས་པ་དང་། དགེ་བ་ཡོངས་སུ་བཙལ་བ་ལ་མངོན་པར་བརྩོན་པ་དང་། རྟག་ཏུ་དགེ་བའི་བཤེས་གཉེན་དང་འགྲོགས་པ་རྙེད་པར་འགྱུར།
en: They will be intelligent, learned, bright, prudent, focused on pursuing virtue, and will always find company with a spiritual teacher.

source: བདུད་ཀྱི་ཞགས་པ་གཅོད་པ་དང་། མ་རིག་པའི་སྒོ་ངའི་སྦུབས་གཅོག་པ་དང་། ཉོན་མོངས་པའི་ཆུ་ཀླུང་སྐེམས་པར་འགྱུར།
en: They will cut Māra’s bonds, crush the eggshell of ignorance, and dry up the river of the afflictions.

source: སྐྱེ་བ་དང་། རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར་རོ།
en: They will be liberated from birth, old age, death, anguish, lamentation, suffering, unhappiness, and conflict.

source: །འཇམ་དཔལ་གཞན་ཡང་སེམས་ཅན་གང་དག་ཕྲ་མ་ལ་མངོན་པར་དགའ་ཞིང་། སེམས་ཅན་གང་དག་ཕན་ཚུན་འཐབ་པ་དང་། རྩོད་པ་དང་། འགྱེད་པར་བྱེད་དུ་འཇུག་པ་དག་ཡོད་དེ།
en: “Mañjuśrī, there are also those beings who delight in slander and beings who instigate fights, arguments, and disputes with one another.

source: སེམས་ཅན་དེ་དག་རྣམ་པར་རྩོད་པའི་སེམས་སུ་གྱུར་པས་ལུས་དང་། ངག་དང་། ཡིད་ཀྱིས་མི་དགེ་བ་རྣམ་པ་སྣ་ཚོགས་མངོན་པར་འདུ་བྱེད་དོ།
en: Such contentious beings commit various types of nonvirtuous actions with their body, speech, and mind.

source: །གཅིག་ལ་གཅིག་ཕན་པ་མ་ཡིན་པ་འདོད་ཅིང་རྟག་ཏུ་ཕན་ཚུན་གནོད་པར་བྱ་བའི་ཕྱིར་བརྩོན་ཏེ།
en: They do not wish to benefit one another and constantly try to harm one another.

source: དེ་དག་ནགས་ཚལ་གྱི་ལྷ་དང་། ཤིང་གི་ལྷ་དང་། རིའི་ལྷ་འགུགས་པར་བྱེད། དུར་ཁྲོད་རྣམས་སུ་འབྱུང་པོ་ཐ་དད་པ་དག་འགུགས་པར་བྱེད།
en: They summon a forest deity, tree deity, or mountain deity, or they summon the various spirits in the charnel grounds.

source: དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བའི་སྲོག་ཆགས་རྣམས་ཀྱི་སྲོག་གཅོད་ཅིང་ཤ་དང་། ཁྲག་ཟ་བའི་གནོད་སྦྱིན་དང་། སྲིན་པོ་རྣམས་མཆོད་པར་བྱེད་དེ།
en: They kill beings who have taken birth as animals and offer them to the yakṣas and rākṣasas who eat flesh and blood.

source: དགྲ་བོ་དེའི་མིང་ནས་བརྗོད་པའམ།
en: They utter the name of their enemy or create an effigy, cast a violent spell at them, and enlist a kākhorda or vetāla to create obstacles in their life with the hope that they will destroy their enemy’s body.

source: གཟུགས་བྱས་ནས་དེར་རིག་སྔགས་དྲག་པོ་སྒྲུབ་ཅིང་བྱད་སྟེམས་དང་། རོ་ལངས་ཀྱི་སྦྱོར་བས་སྲོག་གི་བར་ཆད་བྱ་བ་དང་། ལུས་རྣམ་པར་གཞིག་པར་འདོད་པ་ལ་གང་དག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་དེའི་མཚན་ཐོས་པར་གྱུར་པ་དེ་དག་ལ་གང་གིས་ཀྱང་བར་ཆད་བྱ་བར་མི་ནུས་ཏེ།
en: However, no one can create obstacles for those who have heard the name of the blessed Thus-Gone One Bhaiṣajya­guru­vaiḍūrya­prabha.

source: དེ་དག་ཕན་ཚུན་བྱམས་པའི་སེམས་དང་། ཕན་པའི་སེམས་དང་། གནོད་སེམས་མེད་པའི་སེམས་སུ་གནས་པར་འགྱུར་རོ། །རང་རང་གི་བདོག་པས་ཆོག་ཤེས་པར་འགྱུར་རོ།
en: Such people are loving to one another, beneficent, free from ill will, and satisfied with their own possessions.

source: །འཇམ་དཔལ་གཞན་ཡང་འཁོར་བཞི་པོ་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་དེ་དག་དང་། གཞན་ཡང་དད་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་བསྙེན་གནས་ལ་ཉེ་བར་གནས་ཏེ། ལོ་གཅིག་གམ།
en: “Moreover, Mañjuśrī, among the fourfold assembly of monks, nuns, male lay practitioners, and female lay practitioners, as well as among other faithful sons or daughters of good family who observe the eightfold precepts, there are some who maintain the precepts for one year or three months.

source: ཟླ་བ་གསུམ་དུ་བསླབ་པའི་གཞི་རྣམས་འཛིན་ཅིང་གང་དག་གི་བསམ་པས་བདག་གི་དགེ་བའི་རྩ་བ་འདིས་ནུབ་ཕྱོགས་གང་ན་དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་བཞུགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་ཤོག་ཤིག་ཅེས་སྨོན་ལམ་དེ་ལྟ་བུ་བཏབ་པ་དག་ལས་གང་དག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་དེའི་མཚན་ཐོས་པར་གྱུར་པ་དེ་དག་འཆི་བའི་དུས་ཀྱི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་རྫུ་འཕྲུལ་གྱིས་ལྷགས་ནས་ལམ་སྟོན་པར་འགྱུར་ཏེ།
en: If they develop an aspiration, saying, ‘Due to my root of virtue, may I be reborn in the west in Sukhāvatī, the world where the Thus-Gone One Amitāyus resides,’ they will hear the name of the blessed Thus-Gone One Bhaiṣajya­guru­vaiḍūrya­prabha.

source: དེ་དག་དེར་པདྨ་ཚོན་ཁ་དོག་སྣ་ཚོགས་རྣམས་ལ་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ།
en: Then, at the moment of death, the eight bodhisattvas will miraculously appear, show them the way, and they will take miraculous birth there upon brightly colored lotuses.

source: །གང་ལ་ལ་དག་ལྷའི་འཇིག་རྟེན་དུ་སྐྱེ་བར་འགྱུར་བ་དེ་དག་ནི་དེར་སྐྱེས་ནས་སྔོན་གྱི་དགེ་བའི་རྩ་བ་དེ་ཟད་པར་མི་འགྱུར་ཞིང་ངན་འགྲོར་འགྲོ་བར་མི་འགྱུར་རོ།
en: “Some will be born in the god realms, and after they are born there, their previous roots of virtue will never be exhausted, and they will not proceed to the lower realms.

source: །དེ་ནས་ཤི་འཕོས་ནས་ཀྱང་མིའི་འཇིག་རྟེན་འདིར་གླིང་བཞི་པའི་དབང་ཕྱུག་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་ཏེ། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་འགོད་པར་འགྱུར་རོ།
en: After they pass away, they will become universal emperors with dominion over the four continents in this human realm, and they will establish many billions of beings on the path of the ten virtuous actions.

source: །གཞན་དུ་ན་ཡང་རྒྱལ་རིགས་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུའི་ཁྱིམ་དག་ཏུ་སྐྱེ་བར་འགྱུར། བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུའི་ཁྱིམ་དག་དང་། ཁྱིམ་བདག་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུའི་ཁྱིམ་དག་དང་། ནོར་དང་། འབྲུ་དང་། མཛོད་དང་། བང་བ་མང་པོ་འབྱོར་པའི་ཁྱིམ་དག་ཏུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: “Others will be born in great kṣatriya households , born in great brahmin households , born in great landowning households , and born in households whose treasuries and storehouses contain and abundance of riches and grain.

source: གཟུགས་ཕུན་སུམ་ཚོགས་པ་དང་། དབང་ཕྱུག་ཕུན་སུམ་ཚོགས་པ་དང་། གཡོག་ཕུན་སུམ་ཚོགས་པ་དང་། དཔའ་བ་དང་རྟུལ་ཕོད་པ་དང་། ཚན་པོ་ཆེ་ཆེན་པོའི་སྟོབས་ཀྱི་ཤུགས་དང་ལྡན་པར་འགྱུར་རོ།
en: They will have excellent physiques, be powerful, have attendants, be courageous and heroic, and have the strength of a great champion.

source: །བུད་མེད་གང་གིས་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་ཐོས་ཤིང་བཟུང་བ་དེའི་བུད་མེད་ཀྱི་དངོས་པོ་དེ་ཐ་མ་པ་ཡིན་པར་ཤེས་པར་བྱའོ།
en: Any woman who should hear the Thus-Gone One’s name and bear it in mind should know that it is the last time she will be of the female gender.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སླད་མའི་ཚེ་སླད་མའི་དུས་ན་གང་དག་མདོ་འདི་འཆང་བ་དང་། ཀློག་པ་དང་། འཆད་པ་དང་། གཞན་དག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་པ་དང་། ཡི་གེར་འདྲི་བ་དང་། ཡི་གེར་འདྲིར་སྩོལ་བ་དང་། གླེགས་བམ་ལ་བྲིས་ཏེ་མེ་ཏོག་དང་། བདུག་པ་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། གདུགས་དང་། རྒྱལ་མཚན་རྣམས་ཀྱིས་བཀུར་སྟི་བགྱིད་པའི་དད་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་ལ་བདག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་དེའི་མཚན་རྣམ་པ་སྣ་ཚོགས་སུ་བསྒྲག་པར་བགྱིའོ།
en: At that point Mañjuśrīkumārabhūta told the Blessed One, “Blessed One, in the future I will proclaim the name of the blessed Thus-Gone One Bhaiṣajya­guru­vaiḍūrya­prabha in various ways to those faithful sons and daughters of good family who hold this discourse, recite it, explain it, teach it correctly and in detail to others, copy it, commission it to be copied, write it in a book, and venerate it with flowers, incense, garlands, ointments, parasols, and victory banners.

source: །ཐ་ན་རྨི་ལམ་དུ་ཡང་སངས་རྒྱས་ཀྱི་མཚན་རྣ་ལམ་དུ་ཉེ་བར་བསྒྲག་པར་བགྱིའོ།
en: I will proclaim it so that they will even hear that buddha’s name in their dreams.

source: །ཚོན་སྣ་ལྔ་པའི་གོས་རྣམས་ཀྱིས་དཀྲིས་ཏེ།
en: “They will wrap this discourse with cloths of the five different colors and place it in a clean area.

source: ཕྱོགས་གཙང་མར་བཞག་ན་གང་ན་མདོ་སྡེ་འདི་གནས་པ་དེར་རྒྱལ་པོ་ཆེན་པོ་བཞི་འཁོར་དང་བཅས་པ་དང་། ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གཞན་ཡང་མཆི་བར་འགྱུར་རོ།
en: The Four Great Kings with their retinues and billions of deities will gather wherever this discourse is located.

source: །གང་དག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བཻ་ཌཱུརྱའི་འོད་དེའི་མཚན་དང་སྔོན་གྱི་སྨོན་ལམ་གྱི་ཁྱད་པར་རྒྱས་པའི་མདོ་འདི་འཛིན་པ་དེ་དག་དུས་མ་ལགས་པར་འགུམ་པར་མི་འགྱུར།
en: Those who retain the name of the blessed Thus-Gone One Bhaiṣajya­guru­vaiḍūrya­prabha and this discourse on the detailed account of his previous aspirations will not suffer untimely deaths.

source: སུས་ཀྱང་མདངས་འཕྲོག་མི་ནུས་ཏེ། ཕྲོགས་ན་ཡང་སླར་ཕྲོགས་པར་འགྱུར་རོ།
en: No one will be able to steal their vital energy, and if it has been stolen, they will take it back.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་དེ་དེ་བཞིན་ཏེ།
en: The Blessed One replied, “It is so, Mañjuśrī.

source: ཇི་སྐད་སྨྲས་པ་བཞིན་ནོ།
en: What you say is true.

source: །འཇམ་དཔལ་དད་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་དེ་བཞིན་གཤེགས་པ་དེ་ལ་མཆོད་པ་བྱེད་པ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་དེའི་སྐུ་གཟུགས་བྱས་ཏེ། ཉིན་ཞག་བདུན་དུ་འཕགས་པའི་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་བསྙེན་གནས་ལ་ཉེ་བར་གནས་པར་བྱ་ཁ་ཟས་གཙང་མ་བཟའ་ཞིང་ལུས་ལེགས་པར་བཀྲུས་ཏེ།
en: Mañjuśrī, a faithful son or daughter of good family who makes offerings to that thus-gone one should make a statue of that thus-gone one and observe the fast associated with the noble eightfold precepts for seven days and seven nights. They should eat pure food and thoroughly wash their body.

source: གོས་བཟང་པོ་དྲི་མ་མེད་པ་བགོ་ཞིང་ཕྱོགས་གཙང་མར་མེ་ཏོག་སྣ་ཚོགས་སིལ་མ་བཀྲམ་པ། སྤོས་སྣ་ཚོགས་ཀྱིས་བདུགས་པ།
en: They should wear fine, clean clothes. Then, in a clean area, they should scatter the petals of various flowers and perfume the area with various fragrances.

source: རས་དང་། གདུགས་དང་། རྒྱལ་མཚན་སྣ་ཚོགས་ཀྱིས་ལེགས་པར་བརྒྱན་པའི་ས་ཕྱོགས་སུ་དྲི་མ་མེད་པའི་སེམས་དང་། རྙོག་པ་མེད་པའི་སེམས་དང་། གནོད་སེམས་མེད་པའི་སེམས་དང་། བྱམས་པའི་སེམས་དང་། བཏང་སྙོམས་ཀྱི་སེམས་དང་། མཉམ་པའི་སེམས་སུ་བྱ།
en: They should then decorate the place with various cloths, parasols, and banners. There, they should then cultivate a stainless mind, an untainted mind, a mind free from ill intent, a benevolent mind, an impartial mind, and an equanimous mind.

source: །རོལ་མོའི་སྒྲ་དང་། །སིལ་སྙན་དང་། གླུ་དབྱངས་བླང་ཞིང་དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་དེ་ལ་བསྐོར་བ་བྱ་སྟེ།
en: They should then play music, instruments, and sing songs as they circumambulate the statue of that thus-gone one.

source: དེའི་སྔོན་གྱི་སྨོན་ལམ་ཡང་ཡིད་ལ་བྱ་ཞིང་མདོ་སྡེ་འདི་ཡང་བསྟན་ན་གང་བསམས་པ་དང་། གང་སྨོན་པའི་བསམ་པ་དང་། དེ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: “If they contemplate his previous aspirations and teach this discourse, all their wishes and aspirations will be fulfilled.

source: གལ་ཏེ་ཚེ་རིང་བར་སྨོན་ན་ནི་ཚེ་རིང་པོར་འགྱུར་རོ། །གལ་ཏེ་ལོངས་སྤྱོད་འབྱོར་བར་འགྱུར་རོ།
en: If they aspire to a long life, they will have a long life.

source: །གལ་ཏེ་དབང་ཕྱུག་དང་ལྡན་པར་སྨོན་ན་ནི་ཚེགས་ཆུང་དུས་རྙེད་པར་འགྱུར་རོ།
en: If they pray for wealth, they will have wealth. If they pray to become a powerful ruler, they will achieve that with little trouble.

source: །གལ་ཏེ་བུ་འདོད་ན་ནི་བུ་རྙེད་པར་འགྱུར་རོ།
en: If they wish for a son, they will have a son.

source: །གང་དག་སྡིག་པ་ཅན་གྱི་རྨི་ལམ་རྨིས་སམ་གང་དུ་བྱ་ཁྭ་དང་། ལྟས་ངན་མཐོང་ངམ། གནས་གང་དུ་བཀྲ་མི་ཤིས་པ་བརྒྱད་དག་གནས་པར་གྱུར་པ་ལ་གང་དག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་བླ་བཻ་ཌཱུརྱའི་འོད་དེ་ལ་མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བཀུར་སྟི་བྱེད་ན། རྨི་ལམ་ངན་པ་དང་། ལྟས་ངན་པ་དང་། བཀྲ་མི་ཤིས་པའི་དངོས་པོ་ཐམས་ཅད་མཐོང་བར་མི་འགྱུར་རོ།
en: “If someone has a bad dream, sees a crow or a bad omen somewhere, or dwells in a location where the one hundred inauspicious things are present and venerates the blessed Thus-Gone Bhaiṣajya­guru­vaiḍūrya­prabha with the various types of offerings, then the bad dreams, bad omens, and inauspicious things will no longer appear.

source: །གང་དག་མེས་འཇིགས་པ་དང་། ཆུས་འཇིགས་པ་དང་། མཚོན་གྱིས་འཇིགས་པ་དང་། དུག་གིས་འཇིགས་པ་དང་། གཡང་སས་འཇིགས་པ་དང་། གླང་པོ་ཆེ་གཏུམ་པོས་འཇིགས་པ་དང་། སེང་གེས་འཇིགས་པ་དང་། སྟག་གིས་འཇིགས་པ་དང་། དོམ་དང་། དྲེད་དང་། སྦྲུལ་གདུག་པས་འཇིགས་པ་དང་། སྡིག་པ་དང་། རྐང་ལག་བརྒྱད་པས་འཇིགས་པ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་མཆོད་པ་བྱས་ན་འཇིགས་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར་རོ།
en: “If those who face dangers from fire, dangers from water, dangers from weapons, dangers from poison, dangers from steep cliffs, dangers from raging elephants, dangers from lions, dangers from tigers, dangers from bears, hyenas, and poisonous snakes, and dangers from snakes, scorpions, and spiders have made offerings to that thus-gone one, they will be freed from all manner of dangers.

source: །གང་དག་ཕ་རོལ་གྱི་དམག་ཚོགས་ཀྱིས་འཇིགས་པ་དང་། རྐུན་པོས་འཇིགས་པ་དང་། ཆོམ་པོས་འཇིགས་པ་དེ་དག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དེ་ལ་མཆོད་པ་བྱའོ།
en: Those who face dangers from enemy armies, dangers from thieves, and dangers from bandits should also make offerings to that thus-gone one.
